inletoutlet/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00135;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00135;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.00135;
        value           uniform 0.00135;
    }
    wall
    {
        type            kqRWallFunction;
        value           uniform 0.00135;
    }
    top
    {
        type            slip;
    }
}


// ************************************************************************* //
