inletoutlet/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 135;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 135;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 135;
        value           uniform 135;
    }
    wall
    {
        type            omegaWallFunction;
        value           uniform 135;
    }
    top
    {
        type            slip;
    }
}


// ************************************************************************* //
