inletoutlet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          146;
        startFace       102591;
    }
    outlet
    {
        type            patch;
        nFaces          146;
        startFace       102737;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          7395;
        startFace       102883;
    }
    top
    {
        type            patch;
        nFaces          1212;
        startFace       110278;
    }
)

// ************************************************************************* //
