inletoutlet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin -4;
xmax  16;
ymin -1;
ymax  7;
zmin -1;
zmax  2;

/*
xcells 30;
ycells 20;
zcells 20;
*/

dx 0.25;
dy 0.25;
dz 0.25;

lx #calc "$xmax - $xmin";
ly #calc "$ymax - $ymin";
lz #calc "$zmax - $zmin";

xcells #calc "abs(($lx)/($dx))";
ycells #calc "abs(($ly)/($dy))";
zcells #calc "abs(($lz)/($dz))";

vertices        
(
    ($xmin  $ymin  $zmin)
    ($xmax  $ymin  $zmin)
    ($xmax  $ymax  $zmin)
    ($xmin  $ymax  $zmin)
    ($xmin  $ymin  $zmax)
    ($xmax  $ymin  $zmax)
    ($xmax  $ymax  $zmax)
    ($xmin  $ymax  $zmax)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges           
(
);

/*
patches         
(
    patch minX
    (
        (0 4 7 3)
    )
    patch maxX
    (
        (2 6 5 1)
    )
    patch minY
    (
        (1 5 4 0)
    )
    patch maxY 
    (
        (3 7 6 2)
    )
    patch minZ
    (
        (0 3 2 1)
    )
    patch maxZ
    (
        (4 5 6 7)
    )
);
*/

boundary        
(
    minX
    {
        type patch;
	faces
	( 
            (0 4 7 3)
	);
    }

    maxX
    {
        type patch;
	faces
	( 
            (2 6 5 1)
	);
    }

    minY
    {
        type patch;
	faces
	( 
            (1 5 4 0)
	);
    }

    maxY 
    {
        type patch;
	faces
	( 
            (3 7 6 2)
	);
    }

    minZ
    {
        type patch;
	faces
	( 
            (0 3 2 1)
	);
    }

    maxZ
    {
        type patch;
	faces
	( 
            (4 5 6 7)
	);
    }

);

mergePatchPairs 
(
);

// ************************************************************************* //
