inletoutlet/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    //option one used for steady solver
    default         steadyState;
/* 
    //option two used for unsteady solver
    default         CrankNicolson 0;  //or 0.3;
*/
}

gradSchemes
{
    default 	    cellLimited Gauss linear 0.5;
    grad(U)         cellLimited Gauss linear 1;
  
  
  //default 	     leastSquares;
  //default 	     cellMDLimited leastSquares 0.5;
  //default 	     cellMDLimited Gauss linear 1;

}

divSchemes
{
    default         none;
   
    //div(phi,U)      Gauss upwind;
    //div(phi,U)      Gauss linear;
    //div(phi,U)      Gauss limitedLinearV 1;
    div(phi,U)      Gauss linearUpwindV grad(U);

    div(phi,k)		Gauss linearUpwind default;
    div(phi,omega)	Gauss linearUpwind default;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
/*
    div(phi,k)		bounded Gauss linear;
    div(phi,omega)	bounded Gauss linear;
    div(phi,k)		Gauss upwind;
    div(phi,omega)	Gauss upwind;
*/
}

laplacianSchemes
{
//   default         Gauss linear corrected;    
     default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
//  default         corrected;
    default         limited 0.5;
}

wallDist
{
    method Poisson;
}

// ************************************************************************* //
