inletoutlet/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
/*
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;

	minIter 	2;
    }
*/

    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;
	minIter         3;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
	minIter		    3;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

/*
    U
    {
        type            coupled;
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-08 1e-08 1e-08);
        relTol          (0 0 0);
    }
*/

    omega
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

    k
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

    yPsi
    {
        solver		GAMG;
        smoother	GaussSeidel;
        cacheAgglomeration true;
        nCelsInCoarsestLevel 10;
        agglomerator	faceAreaPair;
        mergeLevels     1;
        tolerance       1e-5;
        relTol		0;
     }

}

PIMPLE
{
    momentumPredictor 	yes;
    consistent 		yes; 

//If you set nOuterCorrectors to 1 is equivalent to piso    
    //nOuterCorrectors 1;
    nOuterCorrectors 2;

    nCorrectors 2;
    nNonOrthogonalCorrectors 1;

    //pRefCell        0;
    //pRefValue       0;
/*    
SIMPLE
{
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    consistent yes;   
}
*/
/*
//Recommended for SIMPLE formulation
relaxationFactors
{
    fields
    {
        p   	0.3;  // ensure diagonal equality
    }
    equations
    {
        U   	0.7;  // ensure diagonal equality
        k   	0.7;  // ensure diagonal equality
        omega   0.7;  // ensure diagonal equality
    }
}
*/

//Recommended for SIMPLEC formulation
relaxationFactors
{
    fields
    {
        ".*"   0.9;  // ensure diagonal equality
    }
    equations
    {
        ".*"   0.9;  // ensure diagonal equality
    }
}

// ************************************************************************* //
